Repository: fbdevelopercircles/open-source-edu-bot
Catalog: src/locales/*/LC_MESSAGES/messages.po
Languages: ar, fr, gu, hi, ru, rw, si

source: Let's create a clone of your fork locally on your computer. On GitHub, in your newly forked project, Click on `Code` above the list of files
ar: لنقم بإنشاء نسخة من تفريعتك على جهاز الكمبيوتر الخاص بك. على GitHup ، في مشروعك الجديد المتفرع ، انقر فوق "Code" أعلى جدول الملفات
fr: Créons un clone de ton fork sur ton ordinateur. Sur GitHub, dans ton nouveau projet forké, cliques sur `Code` au-dessus de la liste des fichiers
gu: ચાલો તમારા કમ્પ્યુટર પર તમારા ફોર્કની સ્થાનિક રીતે ક્લોન બનાવીએ। તમારા નવા ફોર્ક્ડ પ્રોજેક્ટમાં, ગિટહબ પર, ફાઇલોની સૂચિની ઉપર `Code` પર ક્લિક કરો।
hi: चलो अपने कंप्यूटर पर स्थानीय रूप से अपने फोर्क का एक क्लोन बनाएं। गिटहब पर, अपने नए फोर्क किए प्रोजेक्ट में, फ़ाइलों की सूची के ऊपर `कोड` पर क्लिक करें
ru: Давайте создадим клон вашего fork'а на вашем компьютере. На GitHub в вашей ветке проекта нажмите «Code» над списком файлов
rw: Reka dukore clone ya folk wakoze kuri mudasobwa yawe. Kuri GitHub, mu mushinga wawe mushya umaze gukorera folk, Kanda kuri `Code` hejuru y'urutonde rwa dosiye
si: අපි දැන් ඔයාගෙ කම්පියුටර් එකේ ඔයාගෙ Fork එකේ පිටපතක් හදමු GitHub එකේ ඔයාගෙ අලුතෙන් Fork කරපු ප්‍රොජෙක්ට් එකට ගිහින් ෆයිල් ලිස්ට් එකට උඩින් තියන `Code` කියන එක ක්ලික් කරන්න

source: When you feel Ready🔥, hit Next to continue.
ar: عندما تشعر أنك جاهز 🔥 ، اضغط على التالي للمتابعة.
fr: Lorsque tu te sens prêt🔥, clique sur Suivant pour continuer.
gu: જ્યારે તમને તૈયાર લાગે, તો ચાલુ રાખવા માટે આગળ ક્લિક કરો।
hi: जब आपको लगे आप तैयार है🔥, तो जारी रखने के लिए अगला दबाएं।
ru: Когда вы почувствуете себя готовым🔥, нажмите Далее (Next), чтобы продолжить.
rw: Niwumva witeguye🔥, kanda ahakurikira kugirango ukomeze.
si: ඔයා සූදානම් නම් 🔥, "Next" ක්ලික් කරන්න ඊලඟ එකට යන්න.

source: To clone the repository using HTTPS, under "Clone with HTTPS", click copy icon. To clone the repository using an SSH key click "Use SSH", then click on copy icon.
ar: لاستنساخ المستودع باستخدام HTTPS ، تحت استنساخ باستخدام HTTPS ، انقر على أيقونة النسخ. لاستنساخ المستودع باستخدام SSH ، انقر استخدم SSH ، ثم انقر على أيقونة النسخ.
fr: Pour cloner le dépôt en HTTPS, sous «Cloner avec HTTPS», clique sur l'icône de copie. Pour cloner le dépôt à l'aide d'une clé SSH, clique sur "Use SSH", puis clique sur l'icône de copie.
gu: HTTPS નો ઉપયોગ કરીને રીપોઝીટરીની ક્લોન કરવા માટે "Clone with HTTPS" વારુનકલ ચિહ્નને ક્લિક કરો । SSH નો ઉપયોગ કરીને રીપોઝીટરીની ક્લોન કરવા માટે "Use SSH" વારુનકલ ચિહ્નને ક્લિક કરો ।
hi: HTTPS का उपयोग करके रिपॉजिटरी को क्लोन करने के लिए, "HTTPS " के साथ क्लोन करें, कॉपी आइकन पर क्लिक करें। SSH कुंजी क्लिक एसएसपी कुंजी का उपयोग करके रिपॉजिटरी को क्लोन करने के लिए, फिर कॉपी आइकन पर क्लिक करें।
ru: Чтобы клонировать репозиторий с использованием HTTPS, в разделе «Clone with HTTPS» («Клонировать с HTTPS») щелкните значок копирования. Чтобы клонировать репозиторий с помощью ключа SSH, нажмите «Use SSH» («Использовать SSH»), затем щелкните значок копирования.
rw: Kugirango uhindure ububiko ukoresheje HTTPS, munsi ya "Clone with HTTPS", kandaishusho ya kopi. Kugirango uhindure ububiko ukoresheje urufunguzo rwa SSH kanda "Use SSH", hanyuma ukande kuriishusho ya kopi.
si: HTTPS වලින් රිපෝ එක පිටපත් කරන්නනම්, "Clone with HTTPS" යටතේ තියන කොපි අයිකන් එක ක්ලික් කරන්න. SSH Key එකකින් පිටපත් කරන්න ඕන නම්, "Use SSH", යටතේ තියන කොපි අයිකන් එක ක්ලික් කරන්න.

source: Now open a terminal, change the current working directory to the location where you want the cloned directory.
ar: افتح الآن سطر الأوامر ، وقم بتغيير مجلد العمل الحالي إلى الموقع الذي تريد فيه نسخ المجلد.
fr: Maintenant, ouvre un terminal, change le répertoire de travail actuel à l'emplacement où tu mis le dépôt cloné.
gu: હવે ટર્મિનલ ખોલો, વર્તમાન વર્કિંગ ડિરેક્ટરીને તે સ્થાન પર બદલો જ્યાં તમને ક્લોન ડિરેક્ટરી જોઈએ છે।
hi: अब एक टर्मिनल खोलें, वर्तमान कार्यशील फ़ोल्डर को उस स्थान पर बदलें जहां आप क्लोन फ़ोल्डर चाहते हैं।
ru: Теперь откройте терминал, измените текущий рабочий каталог на место, где вы хотите клонировать каталог.
rw: Noneho fungura terminal, hindura ububiko ujyeaho ushaka gushyira prooject wakoreye clone.
si: ටර්මිනල් එක ඕපන් කරල දැන් ඉන්න ඩිරෙක්ටරිය වෙනස් කරන්න ඔයා රිපෝ එක පිටපත් කරපු ඩිරෙක්ටරියට.

source: Type `git clone`, and then paste the URL you copied earlier. Press Enter. Your local clone will be created.
ar: اكتب `git clone` ، ثم الصق عنوان الـ URL الذي نسخته سابقًا. اضغط Enter سيتم إنشاء نسختك المحلية.
fr: Tapes `git clone`, puis colles l'URL que copiée précédemment. Appuis sur Entrée. Ton clone local sera créé.
gu: `ગિટ ક્લોન` લખો, અને પછી તમે નકલ કરેલું URL પેસ્ટ કરો। એન્ટર દબાવો તમારું સ્થાનિક ક્લોન બનાવવામાં આવશે।
hi: 'git clone' टाइप करें, और फिर आपके द्वारा पहले कॉपी की गई लिंक पेस्ट करें।
ru: Введите `git clone`, а затем вставьте URL-адрес, который вы скопировали ранее. Нажмите Enter. Ваша локальная копия будет создана.
rw: Andika `git clone`, hanyuma wandike URL wakopiye kare. Kanda Enter. Clone yawe irahita ikorwa.
si: `git clone` කියල ටයිප් කරල කලින් කොපි කරපු URL එක පේස්ට් කරන්න Enter එක ඔබන්න. ඔයාගෙ ලෝකල් පිටපත නිර්මාණය වෙයි.

source: 🥯 3. Update
ar: ٣) التحديث 🥯
fr: 🥯 3. Mettre à jour
gu: 🥯 3. અપડેટ
hi: 🥯 ३. अपडेट

source: Now, you have a local copy of the project, Let's update it!
ar: الآن ، لديك نسخة من المشروع على جهازك ، فلنقم بتحديثها !
fr: Maintenant, tu as une copie locale du projet, mettons-le à jour!
gu: હવે, તમારી પાસે પ્રોજેક્ટની સ્થાનિક નકલ છે, ચાલો તેને અપડેટ કરીએ!
hi: अब, आपके पास परियोजना की एक स्थानीय प्रति है, चलो इसे अपडेट करें!
ru: Теперь у вас есть локальная копия проекта. Давайте обновим ее!
rw: Noneho, ufite kopi ya project, Reka tuyivugurure!
si: දැන් ඔයා ලෝකල් පිටපතක් හැදුවනේ ප්‍රොජෙක්ට් එකේ, දැන් ඒක යාවත්කාලීන කරමු!

source: Amazing 👌🏽
ar: رائع 🏽👌
fr: Génial 👌🏽
gu: સુંદર 👌🏽
hi: अद्भुत 👌🏽
ru: Превосходно 👌🏽
rw: Byiza 👌🏽
si: නියමයි 👌🏽

source: Open the project using your favorite IDE, and look for `contributors.yaml` file
ar: افتح المشروع باستخدام بيئة التطوير المتكاملة المفضلة لديك ، وابحث عن الملف `contributors.yaml`
fr: Ouvre le projet en utilisant ton IDE préféré et recherche le fichier `contributors.yaml`
gu: તમારા મનપસંદ IDE નો ઉપયોગ કરીને પ્રોજેક્ટ ખોલો અને `contributors.yaml` ફાઇલને જુઓ
hi: अपने पसंदीदा आईडीई का उपयोग करके परियोजना खोलें, और `contributors.yaml` देखें
ru: Откройте проект, используя вашу любимую IDE, и найдите файл `depositors.yaml`
rw: Fungura project ukoresheje IDE ukunda, hanyuma ushakishe.`contributors.yaml` file
si: ඔයාගෙ ආසම IDE එකෙන් ප්‍රොජෙක්ට් එක විවෘත කරල, `contributors.yaml` ෆයිල් එක හොයාගන්න

source: This Yaml file contains list of project contributors, just like you.
ar: يحتوي ملف Yaml هذا على قائمة بالمساهمين في المشروع ، مثلك تمامًا.
fr: Ce fichier Yaml contient la liste des contributeurs du projet, tout comme toi.
gu: આ yaml ફાઇલમાં તમારા જેવા પ્રોજેક્ટ પ્રદાન કરનારાઓની સૂચિ છે।
hi: इस यमल फ़ाइल में आपके जैसे ही प्रोजेक्ट योगदानकर्ताओं की सूची है।
ru: Этот файл Yaml содержит список участников проекта, в том числе и вас.
rw: Iyi dosiye ya Yaml ikubiyemo urutonde rwabaterankunga, nkawe.
si: මේ Yaml ෆයිල් එකේ තියනව ප්‍රොජෙක්ට් එකේ ඔයාවගේම අනිත් දායකයෝ ලිස්ට් එක.

source: Following the same scheme, add your name, country and github username to the list.
ar: باتباع نفس الطريقة ، أضف اسمك وبلدك واسم مستخدم GitHub الخاص بك إلى القائمة.
fr: En suivant le même schéma, ajoute ton nom, ton pays et ton nom d'utilisateur github à la liste.
gu: સમાન યોજનાને અનુસરીને, સૂચિમાં તમારું નામ, દેશ અને ગિટહબ વપરાશકર્તાનામ (યુજરનેમ) ઉમેરો।
hi: उसी योजना का अनुसरण करते हुए, सूची में अपना नाम, देश और गिटहब यूजरनेम नाम जोड़ें।
ru: Следуя той же последовательности, добавьте в список свое имя, страну и имя пользователя github.
rw: Kurikiza gahunda imwe, ongeraho izina ryawe, igihugu ndetse n'izina rya github kurutonde.
si: එකම යෝජනා ක්‍රමය අනුගමනය කරමින්, ඔබේ නම, රට සහ GitHub පරිශීලක නාමය ලැයිස්තුවට එක් කරන්න.

source: 🚲 4. Push
ar: ٤) الدفع 🚲
gu: 🚲 4. પુશ
hi: 🚲 ४. पुश

source: Ready to commit & Push your changes?!
ar: هل أنت جاهز للإرسال ودفع تغييراتك البرمجية
fr: Prêt à commiter et à Pusher tes changements ?!
gu: તમારા ફેરફારોનેં કમિ‌ટ‌ કરવા અને પુશ કરવા માટે તૈયાર છો?!
hi: अपने परिवर्तनों के लिए कमिट और पुश करने के लिए तैयार?!
ru: Готовы сделать commit и Push для своих изменений ?!
rw: Witegure commit & Push ibyo wahinduye?!
si: ලෑස්තිද ඔයාගෙ commitටික කරල Push කරන්න?!

source: Way to go 👌🏽
ar: أحسنت 🏽👌
fr: Etapes à suivre 👌🏽
gu: ખૂબ સારું 👌🏽
hi: बहुत अच्छा 👌🏽
ru: Вперед👌🏽
rw: Twagiye 👌🏽
si: අන්න ක්‍රමේ 👌🏽

source: Open your Terminal. Change the current working directory to your local repository. Stage the file by commiting it to your local repository using: `git add .`
ar: افتح الآن سطر الأوامر. قم بتغيير مجلد العمل الحالي إلى مستودعك المحلي. قم باختبار الملف عن طريق إرساله إلى مستودعك المحلي باستخدام الأمر: `git add .`
fr: Ouvre ton Terminal. Déplace toi du répertoire courant vers le répertoire avec le clone du dépôt. Marque le fichier pour la validation dans ton dépôt local en utilisant: `git add .`
gu: તમારું ટર્મિનલ ખોલો। વર્તમાન વર્કિંગ ડિરેક્ટરીને તમારા સ્થાનિક રીપોઝીટરીમાં બદલો। ફાઇલને તમારા સ્થાનિક રીપોઝીટરીમાં `git add .`નો ઉપયોગ કરીને સ્ટેજ કરો।
hi: टर्मिनल खोलें। वर्तमान कार्य फ़ोल्डर को अपने स्थानीय रिपॉजिटरी में बदलें। अपने स्थानीय रिपॉजिटरी का उपयोग करने के लिए फ़ाइल को स्टेज करें: `git add .`
ru: Откройте свой терминал. Измените текущий рабочий каталог на свой локальный репозиторий. Подготовьте файл, зафиксировав его в локальном репозитории, используя: `git add .`
rw: Fungura Terminal. Hindura ububiko bwaho uri ujye aho wabitse ya project. Kora stage kugirango wemeze ibyo wakoze mububiko bwawe bwibanze ukoresheje: `git add .`
si: ටර්මිනල් එක ඕපන් කරගන්න ටර්මිනල් එක ඕපන් කරල දැන් ඉන්න ඩිරෙක්ටරිය වෙනස් කරන්න ඔයා ලෝකල් රිපෝ ඩිරෙක්ටරියට. `git add .` වලින් ඔයාගෙ ෆයිල් එක Stage කරන්න ලෝකල් රිපෝ එකට Commit කරන්න

source: Commit the file that you've staged in your local repository: `git commit -m "Add YOUR_NAME to contributors list"` Make sure to add your name :D
ar: قم بإرسال الملف الذي قمت باختباره في المستودع المحلي الخاص بك باستخدام الأمر: `git commit -m "Add YOUR_NAME to contributors list"` قم بوضع اسمك عوضا عن YOUR_NAME وتأكد من فعل ذلك
fr: Commit le fichier que tu as marqué dans ton dépôt local: `git commit -m " Add YOUR_NAME to contributors list"` Assures-toi d'ajouter ton nom :D
gu: તે ફાઇલને કમિ‌ટ‌ કરો કે તમે તમારા સ્થાનિક રીપોઝીટરીમાં સ્ટેજ કર્યા છે: `git commit -m "Add YOUR_NAME to contributors list"` તમારું નામ ઉમેરવાનું ભૂલશો નહીં :D
hi: उस फ़ाइल के लिए प्रतिबद्ध करें जिसे आपने अपने स्थानीय रिपॉजिटरी में संग्रहित किया है: `git commit -m "अपना नाम योगदानकर्ताओं की सूची में जोड़ें"` अपना नाम जोड़ना सुनिश्चित करें :D
ru: Сделайте commit для файла, который вы разместили в локальном репозитории командой: `git commit -m " Add YOUR_NAME to contributors list"` Не забудьте добавить своё имя :D
rw: Emeza dosiye wateguye(stage) mu bubiko bwawe: `git commit -m \ "Ongeraho amazina yawe kurutonde rwabaterankunga "` menya neza ko wongeyeho izina ryawe: D
si: ඔයා ලෝකල් රිපෝ එකේ Staged කරපු ෆයිල් ටික Commit කරන්න: `git commit -m "Add ඔයාගේ_නම_මෙතන to contributors list"` අමතක නොකර ඔයාගෙ නම දාන්න :D

source: Finally, Push the changes in your local repository to GitHub: `git push origin master`
ar: أخيرًا ، ادفع التغييرات في مستودعك المحلي إلى GitHup باستخدام الأمر: `git push origin master`
fr: Enfin, Push les modifications de ton dépôt local vers GitHub: `git push origin master`
gu: છેવટે, તમારા સ્થાનિક રીપોઝીટરીમાં ફેરફારોને ગિટહબ પર પુશ કરો: `git push origin master`
hi: अंत में, अपने स्थानीय रिपॉजिटरी में गिटहब में परिवर्तन पुश करें:: `git push origin master`
ru: Наконец, отправьте изменения в локальном репозитории на GitHub: `git push origin master`
rw: Hanyuma, Shyira impinduka mububiko bwawe kuri GitHub: `git push origin master`
si: අවසානෙට ඔයාගෙ ලෝකල් රිපෝ එකේ තියන වෙනස්කම් ටික GitHub එකට Push කරන්න: `git push origin master`

source: 🔐 5. Merge
ar: ٥) الدمج 🔐
gu: 🔐 5. મર્જ કરો
hi: 🔐 ५. मर्ज

source: Ready to make your first PR?!
ar: هل أنت مستعد لإجراء أول طلب سحب لك ؟!
fr: Prêt à faire ta première PR ?!
gu: તમારી પ્રથમ PR બનાવવા માટે તૈયાર છો?!
hi: अपना पहला पीआर बनाने के लिए तैयार ?!
ru: Готовы сделать ваш первый Pull Request?!
rw: Witegure gukora PR yawe yambere?!
si: ඔයාගෙ පලවෙනි PR එක දාන්න ලෑස්තිද?!

source: Proud of you 👌🏽
ar: فخور بك 🏽👌
fr: Fier de toi 👌🏽
gu: મને તામારા પર ગર્વ છે 👌🏽
hi: तुम पर गर्व है 👌🏽
ru: Горжусь вами👌🏽
rw: Ndakwishimiye 👌🏽
si: ආඩම්බරයි ඔයාගැන 👌🏽

source: Now go back to the original repo: https://github.com/fbdevelopercircles/open-source-edu-bot Above the list of files, click `Pull request`.
ar: "عد الآن إلى مستودعك الأصلي: https://github.com/fbdevelopercircles/open-source-edu-bot فوق جدول الملفات ، انقر فوق `طلب السحب`
fr: Reviens maintenant au repo d'origine: https://github.com/fbdevelopercircles/open-source-edu-bot Au-dessus de la liste des fichiers, cliques sur "Pull request".
gu: હવે મૂળ રેપો પર પાછા જાઓ: https://github.com/fbdevelopercircles/open-source-edu-bot ફાઇલોની સૂચિની ઉપર, `Pull request` પર ક્લિક કરો ।
hi: अब मूल रेपो पर जाएँ: https://github.com/fbdevelopercircles/open-source-edu-bot फ़ाइलों की सूची के ऊपर, 'पुल रिक्वेस्ट' पर क्लिक करें।
ru: Теперь вернитесь к исходному репозиторию: https://github.com/fbdevelopercircles/open-source-edu-bot Над списком файлов нажмите "Pull request".
rw: Noneho subira kuri repo y'umwimerere: https://github.com/fbdevelopercircles/open-source-edu-bot Hejuru y'urutonde rwa dosiye, kanda `Pull request`.
si: දැන් ආපහු මුල් රිපෝ එකට යන්න: https://github.com/fbdevelopercircles/open-source-edu-bot ෆයිල් ලිස්ට් එකට උඩින් තියන `Pull request` කියන එක ක්ලික් කරන්න.

source: Make sure that "base branch" & "head fork" drop-down menus both are pointing to `master`.
ar: تأكد من أن القائمتين المنسدلتين "base branch" و "head fork" تشيران إلى `master`.
fr: Assures-toi que les menus déroulants "base branch" et "head fork" pointent tous les deux vers `master`
gu: તે પાકું કરી લો કે "base branch" અને "head fork" , બંને ડ્રોપ-ડાઉન મેનૂ `master` ના તરફ નિર્દેશ કરે છે
hi: सुनिश्चित करें कि "बेस ब्रांच" और "हेड फोर्क" ड्रॉप-डाउन मेनू दोनों `मास्टर` की ओर इशारा कर रहे हैं
ru: Убедитесь, что "base branch" и "head fork" указывают на `master`.
rw: Menya neza ko "base branch" & "head fork" menu zireba hasi zombizerekeza kuri `master`
si: "base branch" ඩ්‍රොප් ඩවුන් මෙනු එකයි, "head fork" ඩ්‍රොප් ඩවුන් මෙනු එකයි `master` එකේද තියෙන්නෙ කියල බලන්න

source: Type a title and description for your pull request. Then click `Create Pull Request`.
ar: اكتب عنوانًا ووصفًا لطلب السحب. ثم انقر فوق `Create Pull Request`
fr: Tape un titre et une description pour ta pull request. Clique ensuite sur `Create Pull Request`
gu: તમારી પુલ રેક્વેસ્ટ માટે શીર્ષક અને વર્ણન લખો. પછી `Create Pull Request` ને ક્લિક કરો।
hi: अपने पुल अनुरोध के लिए एक शीर्षक और विवरण टाइप करें। इसके बाद `क्रिएट पुल रिक्वेस्ट` पर क्लिक करें।
ru: Введите заголовок и описание для вашего пул-реквеста. Затем кликните `Create Pull Request`.
rw: Andika umutwe n'ibisobanuro kubyo usaba gukurura. Noneho kanda `Create Pull Request`.
si: ඔයාගෙ Pull request එකට නමකුයි විස්තරෙයි දාන්න. ඊටපස්සේ ක්ලික් කරන්න `Create Pull Request` ක්ලික් කරන්න

source: ✅ Done
ar: تم ✅
fr: ✅ Terminé
gu: ✅ થઈ ગયું
hi: ✅ काम पूरा हो गया है
ru: ✅ Готово
si: ✅ හරි

source: Have you created your first PR?
ar: هل أنشأت أول طلب سحب لك؟
fr: As-tu créé ta première PR ?
gu: શું તમે તમારું પ્રથમ PR બનાવ્યું છે?
hi: क्या आपने अपना पहला पी.आर. बनाया है?
ru: Вы создали свой первый Pull Request ?
rw: ✅ Byakozwe
si: ඔයාගෙ පලවෙනි PR එක කලාද?

source: 🙌🎉 Bravo %(first_name)s 🙌🎉
ar: 🙌🎉 أحسنت %(first_name)s 🙌🎉
gu: 🙌🎉 ખૂબ સારું %(first_name)s 🙌🎉
hi: 🙌🎉 बहुत बढ़िया %(first_name)s 🙌🎉
si: 🙌🎉 පට්ට %(first_name)s 🙌🎉

source: Now the team will review your PR and merge it ASAP :D
ar: الآن سيقوم الفريق بمراجعة طلب السحب الخاص بك ودمجه في أسرع وقت ممكن
fr: Maintenant, l'équipe examinera ta PR et la fusionnera dès que possible: D
gu: હવે ટીમ તમારા PR ની સમીક્ષા કરશે અને વહેલી તકે તેનું મર્જ કરશે। :D
hi: अब टीम आपके पीआर की समीक्षा करेगी और इसे बहुत जल्द मर्ज कर देगी :D
ru: Теперь команда рассмотрит ваш Pull Request и как можно скорее объединит его с репозиторием : D
rw: Noneho itsinda rizasuzuma PR yawe hanyuma riyihuze ASAP :D
si: දැන් කණ්ඩායම විසින් ඔයාගෙ PR එක බලල ඒක පුලුවන් තරම් ඉක්මනට Merge කරාවි :D

source: Given below are other interesting stuff that we can explore together:
ar: فيما يلي أشياء أخرى مثيرة للاهتمام يمكننا استكشافها معًا
fr: Ci-dessous d'autres choses intéressantes que nous pouvons explorer ensemble :
gu: નીચે આપેલ અન્ય રસપ્રદ સામગ્રી જે આપણે એક સાથે અન્વેષણ કરી શકીએ છીએ:
hi: नीचे अन्य दिलचस्प चीजें हैं जिन्हें हम एक साथ देख सकते हैं:
ru: Ниже приведены другие интересные вещи, которые мы можем изучить вместе:
rw: Munsi y'hari ibindi bintu bishimishije dushobora gushakisha hamwe:
si: පහලින් ඔයාටයි මටයි ගවේශනය කරන්න පුලුවන් වටින දේවල් ටිකක් තියනව:

source: Time to get Git installed in your machine ⭕!
ar: حان الوقت لتثبيت Git على جهازك !⭕
fr: Il est temps d'installer Git sur ta machine ⭕ !
gu: તમારા મશીન પર ગિટ ઇન્સ્ટોલ કરવાનો સમય ⭕!
hi: गिट को अपनी मशीन में स्थापित करने का समय ⭕!
ru: Пора установить Git на ваш компьютер ⭕ !
rw: Igihe cyo gushyira Git mumashini yawe ⭕!
si: GIt ඔයාගෙ පරිඝණකයේ ස්ථාපනය කරගන්න වෙලාව දැන් ⭕!

source: Download Git
ar: تحميل Git
fr: Télécharger Git
gu: ગિટ ડાઉનલોડ કરો
hi: डाउनलोड गिट
ru: Скачать Git
rw: Manura Git
si: Git බාගතකරගන්න

source: Head over here, and download Git Client based on your OS.
ar: توجه إلى هنا ، وقم بتحميل Git Client بناءً على نظام التشغيل الخاص بك.
fr: Rends-toi ici et télécharge le client Git en fonction de ton système d'exploitation.
gu: અહીં જાઓ અને તમારા ઑપરેટિંગ સિસ્ટમ ના આધારે ગિટ ક્લાયંટ ડાઉનલોડ કરો।
hi: यहाँ पर जाएँ, और अपने ओएस के आधार पर गिट टूल डाउनलोड करें।
ru: Зайдите сюда и загрузите Git Client для вашей операционной системы.
rw: Kanda hano, hanyuma umanure Git Client ukurikije OS yawe.
si: මෙතෙන්ට ගිහින් ඔයාගෙ මෙහෙයුම් පද්ධතියට අදාල Git ක්ලයන්ට් එක බාගත කරගන්න.

source: Configure Git ⚒️
ar: تهيئة Git ⚒️
fr: Configurer Git ⚒️
gu: ગિટ ગોઠવો
hi: गिट में बदलाव करें ⚒️
ru: Конфигурировать Git ⚒️
rw: Gukonfigira Git ⚒️
si: Git සකසමු ⚒️

source: 🧑‍🚀 Once done, let's configure Git
ar: 🧑‍🚀 بمجرد الانتهاء من ذلك ، لنقم بتهيئة Git
fr: 🧑‍🚀 Une fois terminé, configurons Git
gu: 🧑‍🚀 એકવાર થઈ જાય, ચાલો ગિટને ગોઠવીએ
hi: 🧑‍🚀 एक बार हो जाने के बाद, गिट में परिवर्तन करें
ru: 🧑‍🚀 После этого, давайте настроим Git
rw: 🧑‍🚀 Bimaze gukorwa, reka duconfigire Git
si: 🧑‍🚀 ඕක ඉවර උනාම අපි Git සකසමු

source: Great Progress so far 👨🏽‍🎓!
ar: تقدم كبير حتى الآن !‍🎓🏽👨
fr: De grands progrès jusqu'à présent 👨🏽‍🎓!
gu: અત્યાર સુધીની મહાન પ્રગતિ 👨🏽‍🎓!
hi: अब तक की शानदार प्रगति 👨🏽‍🎓!
ru: Большой прогресс 👨🏽‍🎓!
rw: Kugeza ubu bimeze neza 👨🏽‍🎓!
si: හොඳට කරන් ආව මේදක්වා👨🏽‍🎓!

source: Now let's configure your Git username and email using the following commands
ar: لنقم الآن بتهيئة اسم مستخدم GitHup الخاص بك وبريدك الإلكتروني باستخدام الأوامر التالية
fr: Maintenant, configure ton nom d'utilisateur et ton e-mail Git à l'aide des commandes suivantes
gu: હવે નીચે આપેલા આદેશોનો ઉપયોગ કરીને તમારા Git યુજરનેમ અને ઇમેઇલને ગોઠવો
hi: अब निम्नलिखित कमांड का उपयोग करके अपने गिट यूजरनेम और ईमेल में बदलाव करें
ru: Теперь давайте настроим ваше имя пользователя и адрес электронной почты Git, используя следующие команды
rw: Noneho reka dushyireho username na email bya Git ukoresheje amategeko akurikira
si: හරි දැන් අපි ඔයාගෙ Git පරිශීලක නාමයයි ඊමේල් එකක් සකසමු පහල විධාන වලින්

source: Don't forget to replace Steve's name and email with your own.
ar: لا تنسَ استبدال اسم ستيف وبريده الإلكتروني باسمك وبريدك الإلكتروني
fr: N'oublies pas de remplacer le nom et l'adresse e-mail de Steve par les tiens
gu: સ્ટીવનું નામ અને ઇમેઇલ તમારી પોતાની સાથે બદલવાનું ભૂલશો નહીં।
hi: Steve के नाम और ईमेल को अपने नाम और ईमेल के साथ बदलना न भूलें।
ru: Не забудьте заменить имя и адрес электронной почты Стива своими.
rw: Ntiwibagirwe gusimbuza izina na email bya Steve ibyawe.
si: ස්ටීව්ගෙ නමයි ඊමේල් එකයි වෙනුවට ඔයාගෙ ඒව දාන්න අමතක කරන්න එපා.

source: These details will be associated with any commits that you create
ar: سيتم ربط هذه التفاصيل بأي إرسال للملفات تقوم بتنفيذها
fr: Ces détails seront associés à tous les commits que tu feras
gu: આ વિગતો તમે બનાવેલ કોઈપણ કમિટ સાથે સંકળાયેલ હશે
hi: ये विवरण आपके द्वारा बनाए गए किसी भी आवागमन से संबद्ध होंगे
ru: Эти данные будут связаны с любыми созданными вами коммитами
rw: Ibisobanuro birambuye bizahuzwa nibikorwa byose ukora
si: මේ විස්තර ඔයා කරන හැම Commit එකක් එක්කම බැඳිල තියනව

source: Now let's check, what is Github?👇🏼
ar: الآن دعنا نتحقق ، ما هو GitHup ؟🏼👇
fr: Voyons maintenant, qu'est-ce que Github ?👇🏼
gu: હવે ચાલો તપાસીએ, ગિટહબ એટલે શું? 👇🏼
hi: अब देखते हैं, गिटहब क्या है?👇🏼
ru: А теперь, давайте посмотрим что такое Github ?👇🏼
rw: Noneho reka dusuzume, Github ni iki? 👇🏼
si: හරි දැන් බලමු, මොකක්ද Github?👇🏼

source: Facebook 🧡 Open Source!
ar: فيسبوك 🧡 مفتوح المصدر !
fr: Facebook 🧡 l'Open Source !
gu: ફેસબુક 🧡 ઓપન સોર્સ!
hi: फेसबुक 🧡 ओपन सोर्स!
si: Facebook 🧡 විවෘත මූලාශ්‍රයන්ට!

source: Facebook manages many Open Source projects in the following areas: ✔️ Android ✔️ Artificial Intelligence ✔️ Data Infrastructure ✔️ Developer Operations ✔️ Development Tools ✔️ Frontend ✔️ iOS ✔️ Languages ✔️ Linux ✔️ Security ✔️ Virtual Reality ...
ar: يدير فيسبوك العديد من المشاريع مفتوحة المصدر في المجالات التالية: ✔ الأندرويد ✔️ الذكاء الاصطناعي ✔️ البنية التحتية للبيانات ✔️ عمليات المطورين ✔️ أدوات التطوير ✔️ الواجهة الأمامية ✔️ أى أو إس (iOS) ✔️ اللغات البرمجية ✔ لينكس ✔ الأمان ✔️ الواقع الافتراضي
fr: Facebook gère de nombreux projets Open Source dans les domaines suivants : ✔️ Android ✔️ Intelligence artificielle ✔️ Structure des données ✔️ Opérations pour développeurs ✔️ Outils pour développeurs ✔️ Frontend ✔️ iOS ✔️ Langues ✔️ Linux ✔️ Sécurité ✔️ Réalité virtuelle ...
gu: Facebook manages many Open Source projects in the following areas: ✔️ ઍંડરૌઇડ ✔️ કૃત્રિમ બુદ્ધિ ✔️ ડેટા ઇન્ફ્રાસ્ટ્રક્ચર ✔️ વિકાસકર્તા કામગીરી ✔️ વિકાસ સાધનો ✔️ ફ્રન્ટએન્ડ ✔️ આઇઓએસ ✔️ ભાષાઓ ✔️ લિનક્સ ✔️ સુરક્ષા ✔️ વર્ચ્યુઅલ રિયાલિટી ...
hi: फेसबुक निम्नलिखित क्षेत्रों में कई ओपन सोर्स प्रोजेक्ट का प्रबंधन करता है: ✔️ एंड्रॉयड ✔️ कृत्रिम होशियारी ✔️ डाटा इन्फ्रास्ट्रक्चर ✔️ डेवलपर संचालन ✔️ विकास के औजार ✔️ फ़्रंटएंड ✔️ आईओएस ✔️ भाषाओं ✔️ लिनक्स ✔️ सुरक्षा ✔️ आभासी वास्तविकता ...
ru: Facebook управляет многими проектами с открытым исходным кодом в следующих областях: ✔️ Android ✔️ Artificial Intelligence (Искусственный интелект) ✔️ Data Infrastructure ✔️ Developer Operations ✔️ Development Tools ✔️ Frontend ✔️ iOS ✔️ Languages ✔️ Linux ✔️ Security ✔️ Virtual Reality ...
rw: Facebook icunga imishinga myinshi ya Open Source mu bice bikurikira: ✔️ Android ✔️ Artificial Intelligence ✔️ Data Infrastructure ✔️ Developer Operations ✔️ Development Tools ✔️ Frontend ✔️ iOS ✔️ Languages ✔️ Linux ✔️ Security ✔️ Virtual Reality ...
si: Facebook එකෙන් ගොඩක් විවෘත මූලාශ්‍ර ප්‍රොජෙක්ට්ස් පහල මාතෘකාවලින් පවත්වාගෙන යනව: ✔️ Android ✔️ Artificial Intelligence ✔️ Data Infrastructure ✔️ Developer Operations ✔️ Development Tools ✔️ Frontend ✔️ iOS ✔️ Languages ✔️ Linux ✔️ Security ✔️ Virtual Reality ...

source: Explore them
ar: استكشفهم
fr: Explore les
gu: તેમને અન્વેષણ કરો
hi: उनका अन्वेषण करें
ru: Рассмотрим их
rw: Zinyuremo
si: ඒව ගවේශනය කරන්න

source: Explore Facebook Open Source projects
ar: استكشف مشاريع فيسبوك مفتوحة المصدر
fr: Explore les projects Open Source de Facebook
gu: ફેસબુક ઓપન સોર્સ પ્રોજેક્ટ્સનું અન્વેષણ કરો
hi: फेसबुक ओपन सोर्स प्रोजेक्ट्स का अन्वेषण करें
ru: Изучите проекты Facebook с открытым исходным кодом
rw: Nyura muri project za Facebook ziri Open Source
si: Facebook විවෘත මූලාශ්‍ර වැඩසටහන් ගවේශනය කරන්න
