Repository: fbdevelopercircles/open-source-edu-bot
Catalog: src/locales/*/LC_MESSAGES/messages.po
Languages: ar, fr, gu, hi, ru, rw, si

source: 🤓 You know what? This chatbot code is Open Source 🔓, it's developed by Facebook Developers Circles members around the world.
ar: 🤓 أتعلم؟ شفرة مصدر هذا المحاور الألى الرقمى (الذي تحاوره الأن) مفتوحة المصدر 🔓 ، تم تطويرها بواسطة أعضاء دوائر مطوري فيسبوك حول العالم.
fr: 🤓 Tu sais quoi ? Le code de ce chatbot est Open Source 🔓, il est développé par des membres des Facebook Developers Circles du monde entier.
gu: 🤓 શું તમે જાણો છો? આ ચેટબૌટ કોડ ઓપન સોર્સ છે, જેનો વિકાસ વિશ્વભરના ફેસબુક ડેવલપર્સ સર્કલ સભ્યો દ્વારા કરવામાં આવે છે।
hi: 🤓 आपको पता है कि? यह चैटबोट कोड ओपन सोर्स है 🔓, यह दुनिया भर में फेसबुक डेवलपर्स सर्किल के सदस्यों द्वारा विकसित किया गया है।
ru: 🤓 Знаете что ? Код этого чат-бота тоже проект с открытым исходным кодом 🔓, он разработан участниками Facebook Developers Circles по всему миру.
rw: 🤓 Uzi nikindi? Izi code za chatbot ni Open Source 🔓, yakozwe n' abanyamuryango ba Facebook Developers Circles bari kw' isi hose.
si: 🤓 ඔයා දන්නවද? මේ චැට් බොට් එකත් විවෘත මූලාශ්‍ර. 🔓, මේක හැදුවෙ ලෝකෙ වටේම ඉන්න Facebook Developers Circles සාමාජිකයන්.

source: %(first_name)s we welcome contributors, or simply feel free to fork the code on GitHub, and create your own chatbot.
ar: %(first_name)s نرحب بالمساهمين ، أو ببساطة لا تتردد في تفريع الكود على GitHup ، وإنشاء المحاور الألى الرقمى الخاص بك.
fr: %(first_name)s nous souhaitons la bienvenue aux nouveaux ontributeurs, ou n'hésite pas à forker le code sur GitHub et à créer ton propre chatbot.
gu: %(first_name)s અમે ફાળો આપનારાઓને આવકારીએ છીએ, અથવા ગિટહબ પર કોડ ફોર્ક કરી શકો છો, અને તમારી પોતાની ચેટબૌટ બનાવી શકો છો।
hi: %(first_name)s हम योगदानकर्ताओं का स्वागत करते हैं, या बस गिटहब पर कोड की एक प्रतिलिपि बनाने के लिए, और अपनी खुद की चैटबोट बनाने के लिए स्वतंत्र महसूस करते हैं।
ru: %(first_name)s мы приветствуем новых участников, не стесняйтесь делать свой fork на GitHub и создавать своего собственного чат-бота.
rw: %(first_name)s twakiriye neza abaterankunga, cyangwa wisanzure mugukora folk yakode kuri GitHub, hanyuma ukore chatbot yawe bwite.
si: %(first_name)s අපි සාදරයෙන් පිලිගන්නව වෙනස් කිරීම්, GitHub එකේ Fork කරන එක හා ඔයාගෙම චැට්බොට් එකක් හදන එක.

source: The Source Code
ar: الكود (شفرة المصدر)
fr: Le Code Source
gu: સોર્સ કોડ
hi: सोर्स कोड
ru: Исходный код
rw: Source Code
si: මූලික කේතය

source: Join a circle
ar: انضم إلى دائرة
fr: Réjoins un Circle
gu: એક સર્કલમાં જોડાઓ
hi: एक समूह में शामिल हों
ru: Присоединиться к Circle
rw: Injira mu ruziga
si: වටේකට එකතු වෙන්න

source: 🚶🏽‍♀️ Main Menu 🗄️
ar: ‍♀️🏽🚶‍ القائمة الرئيسية 🗄
fr: 🚶🏽‍♀️ Menu principal 🗄️
gu: 🚶🏽‍♀️ મુખ્ય મેનુ 🗄️
hi: 🚶🏽‍♀️ मुख्य मेनू 🗄️
ru: 🚶🏽‍♀️ Главное меню 🗄️
rw: 🚶🏽‍♀️Menu nyamukuru 🗄️
si: 🚶🏽‍♀️ ප්‍රධාන මෙනුව 🗄️

source: Select an option 👇🏼
ar: حدد اختيارا 🏼👇
fr: Sélectionne une option 👇🏼
gu: કોઈ વિકલ્પ પસંદ કરો 👇🏼
hi: एक विकल्प चुनें 👇🏼
ru: Выберите опцию 👇🏼
rw: Hitamo uburyo 👇🏼
si: එකක් තෝරාගන්න 👇🏼

source: Coming soon!
ar: قريبا!
fr: Bientôt disponible !
gu: ટૂક સમયમાં આવી રહ્યું છે!
hi: जल्द आ रहा है!
ru: Уже скоро !
rw: Bizaza vuba!
si: ඉක්මනින්ම එනව!

source: Open-Source Software, is any Software available for modification ⌨️.This usually includes a license for programmers to change and contribute to the software. 🔧Programmers can fix bugs, improve the software, or adapt it according to their own needs! 🆓
hi: ओपन-सोर्स सॉफ्टवेयर, संशोधन के लिए उपलब्ध कोई सॉफ्टवेयर है"।⌨️इसमें आमतौर पर प्रोग्रामर के लिए सॉफ्टवेयर में बदलाव और योगदान करने का लाइसेंस शामिल है।🔧प्रोग्रामर बग्स को ठीक कर सकते हैं, सॉफ़्टवेयर में सुधार कर सकते हैं, या अपनी आवश्यकताओं के अनुसार इसे अनुकूलित कर सकते हैं!🆓
ru: Open-Source Software (ПО с открытым исходным кодом), это программное обеспечение открытое для редактирования исходного кода ⌨️. Оно обычно включает в себя лицензию для программистов на редактирование и внесение изменений в исходный код. 🔧Программисты могут править баги и усовершенствовать программы.! 🆓
rw: Gufungura-Inkomoko ya Porogaramu, ni Porogaramu iyo ari yo yose iboneka kugira ngo ihindurwe ⌨️.Ubusanzwe ibi birimo uruhushya rwabashinzwe porogaramu guhindura no gutanga umusanzu muri software. 🔧Abashinzwe porogaramu barashobora gukosora amakosa, kunoza porogaramu, cyangwa kuyihuza bakurikije ibyo bakeneye! 🆓
si: විවෘත-මෘදුකාංග මෘදුකාංගය, වෙනස් කිරීම සඳහා ඇති ඕනෑම මෘදුකාංගයකි ⌨️.සාමාන්‍යයෙන් මෙය ක්‍රමලේඛකයින්ට මෘදුකාංගය වෙනස් කිරීමට සහ දායක වීමට බලපත්‍රයක් ඇතුළත් වේ. 🔧
