Repository: fbdevelopercircles/open-source-edu-bot
Catalog: src/locales/*/LC_MESSAGES/messages.po
Languages: ar, fr, gu, hi, ru, rw, si

source: Friend
ar: صديق
fr: Ami(e)
gu: મિત્ર
hi: दोस्त
ru: Друг
rw: Nshuti
si: යාළුවා

source: 🙏🏼 Hi %(first_name)s, so you’ve decided to make your first steps in Open Source. That’s great.
ar: 🙏🏼 اهلا %(first_name)s, إنك تتخذ خطواتك الأولى في المصادر المفتوحة. ذلك رائع.
fr: 🙏🏼 Salut %(first_name)s, tu t'es décidé à faire tes premiers pas dans l'Open Source. C'est génial.
gu: 🙏🏼 નમસ્તે %(first_name)s, તેથી તમે ઓપન સોર્સમાં તમારા પ્રથમ પગલાં લેવાનું નક્કી કર્યું છે। તે મહાન છે।
hi: 🙏🏼नमस्ते %(first_name)s, इस प्रकार आपने ओपन सोर्स में अपना पहला कदम उठाने का फैसला किया है। यह बढ़िया है।
ru: 🙏🏼 Привет %(first_name)s вы решили сделать свои первые шаги в мире Open Source? Это замечательно.
rw: 🙏🏼 Muraho %(first_name)s, nuko rero wahisemo gutera intambwe zawe za mbere muri OpenSource. Nibyiza.
si: 🙏🏼 හායි %(first_name)s! , විවෘත මූලාශ්‍රයන්ට ඔබේ පලමු පියවර තියන්න ඔබ තීරණය කලා එහෙනම්. නියමයි.

source: ✔️ Yes
ar: نعم ✔
fr: ✔️ Oui
gu: ✔️ હા
hi: ✔️ हां
ru: ✔️ Да
rw: ✔️ Ego
si: ඔව්

source: ❌ Not yet
ar: ليس بعد ❌
fr: ❌ Pas encore
gu: ❌ હજી નહિં
hi: ❌ अभी तक नहीं
ru: ❌ Еще нет
rw: ❌ Oya
si: තවම නෑ

source: So, tell me %(first_name)s do you know what Open Source is? 👇🏼
ar: لذا ، أخبرني %(first_name)s هل تعرف ما هي المصادر المفتوحة؟ 🏼👇
fr: Alors, dis-moi %(first_name)s sais-tu ce qu'est l'Open Source ? 👇🏼
gu: તો મને જણાવો %(first_name)s , શું તમે જાણો છો કે ઓપન સોર્સ શું છે? 👇🏼
hi: तो मुझे बताओ %(first_name)s क्या आप जानते हैं कि ओपन सोर्स क्या है? 👇🏼
ru: Итак, расскажите мне %(first_name)s знаете ли вы что такое Open Source ? 👇🏼
rw: Noneho, mbwira %(first_name)s uzi Open source icyo aricyo? 👇🏼
si: ඉතින්, මට කියන්න %(first_name)s! විවෘත මූලාශ්‍ර යනු කුමක්දැයි ඔබ දන්නවාද? 👇🏼

source: Open Source 🔓
ar: المصادر المفتوحة 🔓
gu: ઓપન સોર્સ 🔓
hi: ओपन सोर्स 🔓
si: විවෘත මූලාශ්‍ර

source: Git
gu: ગિટ
hi: गिट
si: ගිට්

source: GitHub
gu: ગિટહબ
hi: गिटहब
si: ගිට්හබ්

source: Make a PR
ar: قدم طلب سحب
fr: Faire une PR
gu: એક પુલ રેક્વેસ્ટ બનાવો
hi: एक पी.आर. बनाओ
ru: Сделать пул-реквест (PR)
rw: Gukora PR
si: PR එකක් දාන්න

source: FB Open Source
ar: فيسبوك مفتوح المصدر
gu: એફબી ઓપન સોર્સ
hi: एफबी ओपन सोर्स
si: FB විවෘත මූලාශ්‍ර

source: Fork me on GitHub
ar: اصنع منى تفريعة على GitHup
fr: Fork sur GitHub
gu: ગિટહબ પર મારી એક નકલ બનાવો
hi: मेरी एक प्रति बनाओ गिटहब पर
ru: Fork на GitHub
rw: Kora fork kuri GitHub
si: ගිට්හබ් එකෙන් මාව Fork කරගන්න

source: Oh you need some help 🆘! This is the main menu, select what you need below 👇🏼
ar: هل أنت بحاجة إلى بعض المساعدة !🆘 هذه هي القائمة الرئيسية ، حدد ما تريده أدناه 🏼👇
fr: Oh, tu as besoin d'aide 🆘 ! Ceci est le menu principal, sélectionne ce dont tu as besoin ci-dessous 👇🏼
gu: સારું તમને થોડી મદદની જરૂર છે 🆘! આ મુખ્ય મેનુ છે, નીચેથી તમારે જેની જરૂર છે તે પસંદ કરો
hi: ओह आपको कुछ मदद चाहिए 🆘! यह मुख्य मेनू है, नीचे से आपको जो आवश्यक है, उसे चुनें 👇🏼
ru: О, вам нужна помощь 🆘 ! Главное меню ниже, выберите то, что вам нужно 👇🏼
rw: Yoo ukeneye ubufasha 🆘! Iyi ni menu nyamukuru, hitamo icyo ukeneye.munsi 👇🏼
si: ඔබට උදව්වක් ඕනෙද? 🆘 මේ ප්‍රධාන මෙනුව, ඔයාට ඕනෙ එක පහලින් තෝරගන්න. 👇🏼

source: I didn't get you %(first_name)s! You said : %(msg)s This is the main menu, select what you need below 👇🏼
ar: لم استطع الاستيعاب %(first_name)s! رسالتك الأخيرة كانت : %(msg)s هذه هي القائمة الرئيسية ، حدد ما تريده أدناه 🏼👇
fr: Je ne t'ai pas compris %(first_name)s ! Tu as écris : %(msg)s Ceci est le menu principal, sélectionne ce dont tu as besoin ci-dessous 👇🏼
gu: હું તમારો પ્રશ્ન સમજી શકતો નથી! %(first_name)s તમે કહ્યું છે : %(msg)s આ મુખ્ય મેનુ છે, નીચે થી તમારે જેની જરૂર છે તે પસંદ કરો 👇🏼
hi: मुझे आपका सवाल समझ नहीं आया! %(first_name)s! तुमने कहा था : %(msg)s यह मुख्य मेनू है, नीचे से आपको जो आवश्यक है, उसे चुनें 👇🏼
ru: Я не понимаю вас, %(first_name)s ! Вы сказали : %(msg)s Это главное меню, выберите, то что вам нужно 👇🏼
rw: Sinumvise %(first_name)s! Wavuze: %(msg)s Iyi ni menu nyamukuru, hitamo ibyo ukeneye hepfo 👇🏼
si: මට තේරූන්නෑ %(first_name)s! ඔයා කිව්වේ : %(msg)s මේ ප්‍රධාන මෙනුව, ඔයාට ඕනෙ එක පහලින් තෝරගන්න. 👇🏼

source: %(first_name)s This is the main menu, select what you need below 👇🏼
ar: %(first_name)s هذه هي القائمة الرئيسية ، حدد ما تريده أدناه 🏼👇
fr: %(first_name)s Ceci est le menu principal, sélectionne ce dont tu as besoin ci-dessous 👇🏼
gu: %(first_name)s આ મુખ્ય મેનુ છે, નીચે થી તમારે જેની જરૂર છે તે પસંદ કરો 👇🏼
hi: %(first_name)s यह मुख्य मेनू है, नीचे से आपको जो आवश्यक है, उसे चुनें 👇🏼
ru: %(first_name)s Главное меню ниже, выберите то, что вам нужно 👇🏼
rw: %(first_name)s Iyi ni menu nyamukuru, hitamo ibyo ukeneye hepfo 👇🏼
si: %(first_name)s මේ ප්‍රධාන මෙනුව, ඔයාට ඕනෙ එක පහලින් තෝරගන්න. 👇🏼

source: This is the main menu, select what you need below 👇🏼
ar: هذه هي القائمة الرئيسية ، حدد ما تريده أدناه 🏼👇
fr: Ceci est le menu principal, sélectionne ce dont tu as besoin ci-dessous 👇🏼
gu: આ મુખ્ય મેનુ છે, નીચે થી તમારે જેની જરૂર છે તે પસંદ કરો 👇🏼
hi: यह मुख्य मेनू है, नीचे से आपको जो आवश्यक है, उसे चुनें 👇🏼
ru: Главное меню ниже, выберите то, что вам нужно 👇🏼
rw: Iyi ni menu nyamukuru, hitamo ibyo ukeneye hepfo 👇🏼
si: මේ ප්‍රධාන මෙනුව, ඔයාට ඕනෙ එක පහලින් තෝරගන්න. 👇🏼

source: So, tell me %(first_name)s do you know what Open source is? 👇🏼
ar: لذا ، أخبرني %(first_name)s هل تعرف ما هي المصادر المفتوحة؟ 🏼👇
fr: Alors, dis-moi %(first_name)s sais-tu ce qu'est l'Open Source ? 👇🏼
gu: પછી મને કહો %(first_name)s શું તમે જાણો છો કે ઓપન સોર્સ શું છે? 👇🏼
hi: तो मुझे बताओ %(first_name)s क्या आप जानते हैं कि ओपन सोर्स क्या है? 👇🏼
ru: Итак, расскажите %(first_name)s знаете ли вы, что такое Open Source ? 👇🏼
rw: Noneho, mbwira %(first_name)s uzi Open source icyo aricyo? 👇🏼
si: ඉතින්, මට කියන්න %(first_name)s! විවෘත මූලාශ්‍ර යනු කුමක්දැයි ඔබ දන්නවාද? 👇🏼

source: Amazing!
ar: رائع!
fr: Génial !
gu: સુંદર !
hi: गजब!
ru: Удивительно !
rw: Byiza!
si: නියමයි!

source: An important component in Open Source contribution is version control tools. Are you familiar with the concept of version control? 👇🏼
ar: تعتبر أدوات التحكم في الإصدار مكونًا مهمًا للمساهمة في المصدر المفتوح. هل تعرف ما هو التحكم في الإصدار؟ 🏼👇
fr: Les outils de contrôle de version sont un élément important de la contribution Open Source. Connaisses-tu le concept de contrôle de version ? 👇🏼
gu: ઓપન સોર્સ યોગદાનમાં એક મહત્વપૂર્ણ ઘટક સંસ્કરણ નિયંત્રણ છે।શું તમે સંસ્કરણ નિયંત્રણ ના ખ્યાલ થી પરિચિત છો? 👇🏼
hi: ओपन सोर्स में योगदान का एक महत्वपूर्ण भाग वर्जन कंट्रोल उपकरण हैं। क्या आप वर्जन कंट्रोल की अवधारणा से परिचित हैं? 👇🏼
ru: Важным компонентом в мире Open Source являются системы контроля версий. Вы знакомы с концепцией контроля версий ? 👇🏼
rw: Ikintu cy'ingenzi mu gutanga umusanzu kuri Open Source ni ibikoresho by' igenzura rya verisiyo. Waba uzi neza ibijyanye n' igenzura rya verisiyo? 👇🏼
si: විවෘත මූලාශ්‍ර වලදි වැදගත් උපාංගයක් තමා අනුවාද පාලන උපාංග. ඔයා සංස්කරණ පාලනය කියන සංකල්පය දන්නවද? 👇🏼

source: According to the dictionary, Open-source 🔓 software, denotes software for which the original source code is made freely 🆓 available and may be redistributed and modified according to the requirement of the user 👨‍💻.
ar: وفقًا للقاموس ، تشير البرامج مفتوحة المصدر 🔓 إلى البرامج التي يتم توفير شفرة المصدر الأصلية لها مجانًا 🆓 ويمكن إعادة توزيعها وتعديلها حسب متطلبات المستخدم 👨‍💻.
fr: Selon le dictionnaire, Logiciel Open-source 🔓, désigne un logiciel pour lequel le code source original est rendu disponible librement 🆓 et peut être redistribué et modifié d'après les besoins de l'utilisateur 👨‍💻.
gu: ડિક્શનરી અનુસાર, ઓપન-સોર્સ 🔓 સોફ્ટવેર, જે માટે મૂળ સ્ત્રોત કોડ મુક્તપણે ઉપલબ્ધ છે 🆓 અને તેને પુનઃવિતરણ અને ફેરફાર કરી શકાય છે। વપરાશકર્તાની જરૂરિયાત મુજબ 👨‍💻.

source: 👉🏽 Next
ar: التالي 🏽
fr: 👉🏽 Suivant
gu: 👉🏽 આગળ
hi: 👉🏽 अगला
ru: 👉🏽 Далее
rw: 👉🏽 Ibikurikiye
si: 👉🏽 ඊලඟ

source: 👩🏽‍🏫 You know ... ✔️ Wordpress, ✔️ Notepad++, ✔️ Ubuntu and thousands of common software started out as Open-source software? 👇🏼
ar: 👩🏽‍🏫 هل تعرف أن ... ✔️ Wordpress, ✔️ Notepad++, ✔️ Ubuntu وآلاف البرامج الشائعة بدأت كبرامج مفتوحة المصدر؟ 🏼👇
fr: 👩🏽‍🏫 Sais-tu que ... ✔️ Wordpress, ✔️ Bloc-notes ++, ✔️ Ubuntu et des milliers de logiciels communs ont commencé comme des logiciels Open Source ? 👇🏼
gu: 👩🏽‍🏫 તમે જાણો છો ... ✔️ વર્ડપ્રેસ, ✔️ નોટપેડ++, ✔️ ઉબુન્ટુ અને હજારો સામાન્ય સોફ્ટવેયર ની શરૂઆત ઓપન સોર્સ સોફ્ટવેયર તરીકે થઈ? 👇🏼
hi: 👩🏽‍🏫 तुम्हे पता हैं ... ✔️ वर्डप्रेस, ✔️ नोटपैड++, ✔️ उबंटू और हजारों सॉफ्टवेयर ओपन सोर्स में शुरू हुए? 👇🏼
ru: 👩🏽‍🏫 Вы знали, что ... ✔️ Wordpress, ✔️ Notepad ++, ✔️ Ubuntu и тысячи других популярных программ начинали свой путь, как Open Source ? 👇🏼
rw: Uzi ... ✔️ Wordpress, ✔️ Notepad ++, Ubuntu n'ibihumbi n'ibihumbi bya porogaramu rusange byatangiye ari Open-source software? 👇🏼
si: 👩🏽‍🏫 ඔබ දන්නවද... ✔️ Wordpress, ✔️ Notepad++, ✔️ Ubuntu සහ දහස් ගණනක් මෘදුකාංග පටං ගත්තෙ විවෘත මූලාශ්‍ර මෘදුකාංග හැරියට බව? 👇🏼

source: 😎 Worry not! Version control allows you to manage changes to files over time ⏱️ so that you can recall specific versions later.
ar: 😎لا تقلق! يسمح لك التحكم في الإصدار بإدارة التغييرات على الملفات بمرور الوقت ️.⏱ بحيث يمكنك استدعاء إصدارات معينة لاحقًا.
fr: 😎 Pas t'inquiètude ! Le contrôle de version te permet de gérer les modifications des fichiers au fil du temps ⏱️ afin que tu puisses rappeler des versions spécifiques plus tard.
gu: 😎 ચિંતા કરશો નહીં ! સંસ્કરણ નિયંત્રણ તમને સમય જતા ફાઇલો માંના ફેરફારો નું સંચાલન કરવાની મંજૂરી આપે છે ⏱️ જેથી તમે પછીથી વિશિષ્ટ સંસ્કરણોને યાદ કરી શકો.
hi: 😎 चिन्ता की कोई बात नहीं! वर्जन कंट्रोल आपको समय के साथ फाइलों में बदलाव का प्रबंधन करने की अनुमति देता है ⏱️। ताकि आप बाद में विशिष्ट संस्करणों को याद कर सकें।
ru: 😎 Не беспокойтесь ! Контроль версий позволяет управлять изменениями файлов ⏱️ чтобы вы могли вспомнить определенные версии позже.
rw: 😎 Ntugire ubwoba! Igenzura rya verisiyo rigufasha gucunga impinduka muri dosiye ighe icyaricyo cyose ⏱️ kugirango ubashe kwibuka verisiyo yihariye nyuma.
si: 😎 වද වෙන්න එපා! වර්ශන් කන්ට්‍රොල් ඔයා කාලයත් එක්ක ෆයිල්ස්වලට කරපු වෙනස්කම් පාලනය කරන්න ඉඩ දෙනව ⏱️ එවිට ඔබට නිශ්චිත අනුවාදයන් පසුව සිහිපත් කළ හැකිය.

source: You can use version control to version code, binary files, and digital assets 🗄️.
ar: يمكنك استخدام أدوات التحكم في الإصدار ؛ لتعيين إصدار : ملفات الأكواد (شفرة المصدر) و ملفات الصيغة الثنائية (لغة الألة) بالإضافة إلى الأصول الرقمية .🗄️
fr: Tu peux utiliser le contrôle de version pour versionner le code, les fichiers binaires et les ressources numériques 🗄️.
gu: તમે સંસ્કરણ નિયંત્રણ, બાયનરી ફાઇલો અને ડિજિટલ સંપત્તિ માટે સંસ્કરણ નિયંત્રણ નો ઉપયોગ કરી શકો છો 🗄️।
hi: आप वर्जन कंट्रोल का उपयोग वर्जन कोड, बाइनरी फाईल्स और डिजिटल संपत्ति में कर सकते हैं 🗄️।
ru: Вы можете использовать контроль версий для кода версий, двоичных файлов и цифровых активов 🗄️.
rw: Ushobora gukoresha Igenzura rya verisiyo muku verisiyona kode zawe, dosiye, nimitungo iri digitale 🗄️.
si: ඔයාට වර්ශන් කන්ට්‍රොල් පාවිච්චි කරන්න පුලුවන් කේත, බයිනරි ෆයිල්ස් හා ඩිජිටල් වස්තූන් සංස්කරණ කරන්න.

source: This includes version control software, version control systems, or version control tools 🧰.
ar: يتضمن ذلك برامج التحكم في الإصدار أو أنظمة التحكم في الإصدار أو أدوات التحكم في الإصدار .🧰
fr: Cela inclut le logiciel de contrôle de version, les systèmes de contrôle de version ou les outils de contrôle de version 🧰.
gu: આમાં સંસ્કરણ નિયંત્રણ સોફ્ટવેયર, સંસ્કરણ નિયંત્રણ સિસ્ટમો અથવા સંસ્કરણ નિયંત્રણ સાધનો શામેલ છે 🧰।
hi: वर्जन कंट्रोल सॉफ्टवेयर, वर्जन कंट्रोल सिस्टम, और वर्जन कंट्रोल टूल्स इसमें शामिल है 🧰।
ru: Сюда входит программное обеспечение для контроля версий, системы контроля версий или инструменты для контроля версий. 🧰.
rw: Ibi birimo porogaramu igenzura verisiyo, sisitemu yo kugenzura verisiyo, cyangwa ibikoresho byo kugenzura verisiyo 🧰.
si: වර්ශන් කන්ට්‍රොල් මෘදුකාංග, වර්ශන් කන්ට්‍රොල් පද්ධති හෝ වර්ශන් කන්ට්‍රොල් මෙවලම් මෙයට ඇතුළත් වේ.

source: Version control is a component of software configuration management 🖥️.
ar: التحكم في الإصدار هو أحد مكونات إدارة تكوين البرامج .🖥️
fr: Le contrôle de version est un composant de la gestion de la configuration logicielle 🖥️.
gu: સંસ્કરણ નિયંત્રણ એ સોફ્ટવેયર ગોઠવણી મેનેજમેન્ટનો એક ઘટક છે 🖥️।
hi: वर्जन कंट्रोल, सॉफ्टवेयर विन्यास प्रबंधन का एक हिस्सा है 🖥️।
ru: Контроль версий - это компонент управления конфигурацией программного обеспечения. 🖥️.
rw: Igenzura rya verisiyo ni igice cyimikorere ya software management 🖥️.
si: වර්ශන් කන්ට්‍රොල් කියන්නෙ මෘදුකාංග සැකසුම් පරිපාලනයේ කොටසක් 🖥️.

source: 😎 Now that you understand what Version control is, let's explore another important topic.
ar: 😎 الآن بعد أن فهمت ماهية التحكم في الإصدار ، دعنا نستكشف موضوعًا آخر مهمًا.
fr: 😎 Maintenant que tu comprends ce qu'est le contrôle de version, explorons un autre sujet important.
gu: 😎 હવે જ્યારે તમે સમજી શકો કે સંસ્કરણ નિયંત્રણ શું છે, ચાલો બીજો મહત્વપૂર્ણ વિષય અન્વેષણ કરીએ ।
hi: 😎 अब जब आप समझ गए हैं कि वर्जन कंट्रोल क्या है, तो आइए एक और महत्वपूर्ण विषय का पता लगाएं।
ru: 😎 Теперь, когда вы понимаете, что такое контроль версий, давайте рассмотрим еще одну важную тему.
rw: 😎 Noneho ko umaze gusobanukirwa icyo kugenzura verisiyo aricyo, reka dusuzume indi ngingo y'ingenzi.
si: 😎 ඔයාට දැන් අනුවාද පාලනය කියන්නෙ මොකක්ද කියල දන්න නිසා අපි අලුත් මාතෘකාවක් ගැන කතාකරමු.

source: What is Git❔
ar: ما هو Git ؟
fr: C'est quoi Git❔
gu: ગિટ એટલે શું❔
hi: गिट क्या है❔
ru: Что такое Git❔
rw: Git niki❔
si: Git කියන්නෙ මොකක්ද❔

source: What is GitHub❔
ar: ما هو GitHub ؟
fr: C'est quoi GitHub ❔
gu: ગિટહબ શું છે❔
hi: गिटहब क्या है❔
ru: Что такое GitHub ❔
rw: Github niki❔
si: GitHub කියන්නෙ මොකක්ද❔

source: What do you want to start with⁉️ 👇🏼
ar: بماذا تريد أن تبدأ!؟ 🏼👇
fr: Par quoi veux-tu commencer ⁉️ 👇🏼
gu: તમે શું પ્રારંભ કરવા માંગો છો⁉️ 👇🏼
hi: आप किस चीज से शुरुआत करना चाहते हैं!? 👇🏼
ru: С чего вы хотели бы начать ⁉️ 👇🏼
rw: Niki ushaka gutangirana nacyo⁉️ 👇🏼
si: මොකෙන්ද ඔයාට පටං ගන්න ඕනෙ⁉️ 👇🏼

source: GitHub is a code hosting platform for version control and collaboration. It lets you and others work together on projects from anywhere.
ar: GitHup هو عبارة عن منصة لاستضافة رموز البرمجيات للتحكم في الإصدار والتعاون. حيث يتيح لك ولغيرك العمل معًا في المشروعات من أي مكان.
fr: GitHub est une plateforme d'hébergement de code pour le contrôle de version et la collaboration. Il te permet, ainsi qu'à d'autres, de travailler ensemble sur des projets depuis n'importe où.
gu: ગિટહબ એ સંસ્કરણ નિયંત્રણ અને સહયોગ માટેનો એક કોડ હોસ્ટિંગ પ્લેટફોર્મ છે। તે તમને અને અન્ય લોકોને ગમે ત્યાંથી પ્રોજેક્ટ્સ પર કામ કરવા દે છે।
hi: गिटहब वर्जन कंट्रोल और सहयोग के लिए एक कोड होस्टिंग प्लेटफ़ॉर्म है। यह आपको और दूसरों को कहीं से भी परियोजनाओं पर एक साथ काम करने देता है।
ru: GitHub - это платформа для размещения кода для контроля версий и совместной работы. Она позволяет вам и другим работать вместе над проектами из любого места.
rw: GitHub ni kode yakira urubuga rwo kugenzura no gukorana.Bituma wowe n'abandi mukorera hamwe mu mishinga aho ariho hose.
si: GitHub කියන්නෙ වර්ශන් කන්ට්‍රොල් තියන හා එකතුවෙලා වැඩකරන්න පුලුවන් කෝඩ් හොස්ටින්ග් ප්ලැට්ෆෝර්ම් එකක්.

source: Official Website
ar: الموقع الرسمي
fr: Site officiel
gu: સત્તાવાર વેબસાઇટ
hi: आधिकारिक वेबसाइट
ru: Официальный вебсайт
rw: Urubuga rwemewe
si: නිල වෙබ් අඩවිය

source: GitHub Tutorial
ar: دروس تعليمية لـ GitHub
fr: Tutoriel GitHub
gu: ગિટહબ ટ્યુટોરિયલ
hi: गिटहब ट्यूटोरियल
ru: Урок по GitHub
rw: Inyigisho za Github
si: Github පාඩම්

source: 👩‍💻 Make a PR
ar: 👩‍💻 قدم طلب سحب
fr: 👩‍💻 Faire une PR
gu: 👩‍💻 એક પુલ રેક્વેસ્ટ બનાવો
hi: 👩‍💻 एक पी.आर. बनाओ
rw: 👩‍💻 Gukora PR
si: 👩‍💻 PR එකක් දාන්න

source: Discover GitHub
ar: تعرف على GitHub
fr: Découvre GitHub
gu: ગિટહબ શોધો
hi: गिटहब खोजो
ru: Обозревать GitHub
rw: Menya GitHub
si: GitHub හඳුනගන්න

source: Discover GitHub official website, or follow a beginner tutorial
ar: اكتشف موقع GitHub الرسمي ، أو اتبع الدروس التعليمية للمبتدئين
fr: Découvre le site officiel de GitHub, ou suis un tutoriel pour débutant
gu: ગિટહબ સત્તાવાર વેબસાઇટ શોધો, અથવા શિખાઉ માણસ ટ્યુટોરિયલ અનુસરો
hi: गिटहब आधिकारिक वेबसाइट की खोज करें, या एक शुरुआती ट्यूटोरियल का पालन करें
ru: Откройте для себя официальный сайт GitHub или следуйте руководству для начинающих
rw: Menya urubuga rwemewe rwa GitHub, cyangwa ukurikire inyigisho zabatangira
si: GitHub නිල වෙබ්අඩවිය හඳුනාගන්න. නැත්නම් නවකයන්ට තියන පාඩමක් කරන්න

source: Good question 👌🏽
ar: سؤال جيد 👌🏽
fr: Bonne question 👌🏽
gu: સારો પ્રશ્ન 👌🏽
hi: अच्छा सवाल 👌🏽
ru: Хороший вопрос 👌🏽
rw: Ikibazo cyiza 👌🏽
si: හොඳ ප්‍රශ්නයක් 👌🏽

source: Git is a type of version control system (VCS) that makes it easier to track changes to files.
ar: Git هو نوع من أنواع نظم التحكم في الإصدارات يُسهل عليك تعقب التغييرات على الملفات
fr: Git est un type de système de contrôle de version (VCS) qui facilite le suivi des modifications apportées aux fichiers.
gu: ગિટ એ એક પ્રકારનું સંસ્કરણ નિયંત્રણ સિસ્ટમ( વર્ઝન કંટ્રોલ સિસ્ટમ ) છે જે ફાઇલોમાંના ફેરફારોને ટ્રેક કરવાનું કામ સરળ બનાવે છે।
hi: गिट एक प्रकार का वर्जन कंट्रोल सिस्टम (वीसीएस) है जो फ़ाइलों में परिवर्तन को ट्रैक करना आसान बनाता है।
ru: Git - это тип системы контроля версий (VCS), упрощающий отслеживание изменений файлов.
rw: Git ni ubwoko bwa sisitemu yo kugenzura verisiyo (VCS) yoroherezagukurikirana impinduka kuri dosiye.
si: Git කියන්නෙ ෆයිල්ස් වලට කරන වෙනස්කම් වාර්තාගත කරන වර්ශන් කන්ට්‍රොල් පද්ධතියක්

source: For example, when you edit a file, Git can help you determine exactly what changed, who changed it, and why.
ar: على سبيل المثال ، عندما تقوم بتحرير ملف ، يمكن أن يساعدك Git في تحديد ما التغير بالضبط ومن قام بتغييره ولماذا.
fr: Par exemple, lorsque qu'on modifie un fichier, Git peut t'aider à déterminer exactement ce qui a changé, qui l'a modifié et pourquoi.
gu: ઉદાહરણ તરીકે, જ્યારે તમે કોઈ ફાઇલને સંપાદિત કરો છો, ત્યારે ગિટ તમને તે નક્કી કરવામાં મદદ કરી શકે છે કે શું બદલાઈ ગયું છે, તેને કોણે બદલ્યું છે અને શા માટે।
hi: उदाहरण के लिए, जब आप किसी फ़ाइल को संपादित करते हैं, तो गिट आपको यह निर्धारित करने में मदद कर सकता है कि क्या बदला, किसने इसे बदला, और क्यों।
ru: Например, когда вы редактируете файл, Git помогает вам точно определить, что изменилось, кто это изменил и почему.
rw: Urugero, iyo uhinduye dosiye, Git ishobora kugufasha kumenya nezaicyahindutse, uwagihinduye, n'impamvu.
si: උදාගරණයක් විදිහට ඔයා ෆයිල් එකක් එඩිට් කලාම, Git වලට පුලුවන් ඔයාට ඒකෙ මොකක්ද වෙනස් උනේ, කව්ද වෙනස් කලේ සහ ඇයි වෙනස් කලේ කියල හොයාගන්න උදව් වෙන්න.

source: 👶🏽 Install Git
ar: 👶🏽 تثبيت Git
fr: 👶🏽 Installer Git
gu: 👶🏽 ગિટ ઇન્સ્ટોલ કરો
hi: 👶🏽 गिट इंस्टॉल करें
ru: 👶🏽 Установить Git
rw: 👶🏽 Shyiramo Git
si: 👶🏽 Git ස්ථාපනය කරන්න

source: 🤓 I've Git Installed
ar: 🤓 لقد قمت بتثبيت Git
fr: 🤓 J'ai installé Git
gu: 🤓 મેં ગિટ ઇન્સ્ટોલ કર્યું છે
hi: 🤓 मैंने गिट इंस्टॉल कर लिया है
ru: 🤓 Я установил Git
rw: 🤓 Git ndayifite
si: 🤓 මං Git ස්ථාපනය කරල තියෙන්නෙ

source: Want to learn more about Git?
ar: هل تريد معرفة المزيد عن Git ؟
fr: Tu veux en savoir plus sur Git ?
gu: ગિટ વિશે વધુ શીખવા માંગો છો?
hi: गिट के बारे में अधिक जानना चाहते हैं?
ru: Хотите узнать больше о Git?
rw: Urashaka kumenya byinshi kuri Git?
si: Git ගැන තව ඉගෙන ගන්න ආසද?

source: Good decision 👌🏽
ar: قرار جيد 🏽👌
fr: Bonne décision 👌🏽
gu: સારો નિર્ણય 👌🏽
hi: अच्छा निर्णय 👌🏽
ru: Хорошее решение 👌🏽
rw: Icyemezo cyiza 👌🏽
si: හොඳ තීරණයක් 👌🏽

source: We are going to split the process into 5 steps: 🛵 Fork, Clone, Update, Push and Merge.
ar: سنقسم العملية إلى 5 خطوات: 🛵 تفريع، استنساخ، تحديث، دفع ودمج.
fr: On va diviser le processus en 5 étapes: 🛵 Fork, Cloner, mettre à jour, Push et Merge.
gu: અમે પ્રક્રિયાને 5 પગલામાં વિભાજીત કરીશું: 🛵 ફોર્ક, ક્લોન, અપડેટ, પુશ અને મર્જ કરો।
hi: हम प्रक्रिया को पांच चरणों में विभाजित करने वाले हैं: 🛵 फोर्क, क्लोन, अपडेट, पुश और मर्ज।
ru: Мы разделяем процесс на 5 шагов: 🛵 Fork, Clone, Update, Push и Merge.
rw: Tugiye kugabanya inzira mu ntambwe 5: 🛵 Fork, Clone, Update, Push and Merge.
si: අපි මේ ප්‍රොසෙස් එක කොටස් 5කට කඩමු: 🛵 Fork, Clone, Update, Push හා Merge.

source: 🥢 1. Fork
ar: ١) التفريع 🥢
gu: 🥢 1. ફોર્ક
hi: 🥢 १. फोर्क

source: Ready for the first step?!
ar: جاهز للخطوة الأولى ؟!
fr: Prêt pour la première étape ?!
gu: પ્રથમ પગલા માટે તૈયાર છો?!
hi: पहले कदम के लिए तैयार ?!
ru: Готовы для первого шага ?!
rw: Witegure intambwe yambere?!
si: සූදානම්ද පලවෙනි පියවරට?!

source: Awesome 👌🏽
ar: ممتاز 👌🏽
fr: Génial 👌🏽
gu: અદ્ભુત 👌🏽
hi: बहुत बढ़िया 👌🏽
ru: Отлично 👌🏽
rw: Byiza 👌🏽
si: නියමයි 👌🏽

source: Open this link in a new window: https://github.com/fbdevelopercircles/open-source-edu-bot
ar: افتح هذا الرابط في نافذة جديدة: https://github.com/fbdevelopercircles/open-source-edu-bot
fr: Ouvre ce lien dans une nouvelle fenêtre: https://github.com/fbdevelopercircles/open-source-edu-bot
gu: આ લિંકને નવી વિંડોમાં ખોલો: https://github.com/fbdevelopercircles/open-source-edu-bot
hi: इस लिंक को नई विंडों में खोलें। https://github.com/fbdevelopercircles/open-source-edu-bot
ru: Откройте эту ссылку в новом окне: https://github.com/fbdevelopercircles/open-source-edu-bot
rw: Fungura iyi link mu idirishya rishya: https://github.com/fbdevelopercircles/fungura-source-edu-bot
si: මේ ලින්ක් එක අලුත් වින්ඩෝ එකක ඕපන් කරගන්න: https://github.com/fbdevelopercircles/open-source-edu-bot

source: Now, click `Fork` on the top right corner of your screen
ar: الآن ، انقر فوق "Fork" في الزاوية اليمنى العليا من شاشتك
fr: Maintenant, clique sur `Fork` dans le coin supérieur droit de ton écran
gu: હવે, તમારી સ્ક્રીનના ઉપરના જમણા ખૂણા પર `ફોર્ક` ક્લિક કરો
hi: अब, अपनी स्क्रीन के ऊपरी दाएं कोने पर `फोर्क` पर क्लिक करें
ru: Теперь нажмите 'Fork' в правом верхнем углу экрана
rw: Noneho, kanda `Fork` hejuru iburyo bwa ecran yawe
si: දැන් ඔයාගෙ ස්ක්‍රීන් එකේ දකුණු පැත්තෙ උඩ තියන `Fork` කියන එක ක්ලික් කරන්න

source: A copy of the original project will be created in your account.
ar: سيتم إنشاء نسخة من المشروع الأصلي في حسابك
fr: Une copie du projet original sera créée sur ton compte.
gu: મૂળ પ્રોજેક્ટની એક નકલ તમારા ખાતામાં બનાવવામાં આવશે।
hi: मूल परियोजना की एक प्रति आपके खाते में बनाई जाएगी।
ru: Копия исходного проекта будет создана в вашем аккаунте.
rw: Kopi originale ya project izashyirwa muri konte yawe.
si: මුල් ප්‍රොජෙක්ට් එකේ කොපියක් ඔයාගෙ එකවුන්ට් එක යටතේ හැදේවි.

source: 🚃 2. Clone
ar: ٢) الاستنساخ 🚃
gu: 🚃 2. ક્લોન
hi: 🚃 २. क्लोन

source: Ready for the next step?!
ar: مستعد للخطوة التالية ؟!
fr: Prêt pour la prochaine étape ?!
gu: આગળના પગલા માટે તૈયાર છો?!
hi: अगले कदम के लिए तैयार हैं ?!
ru: Готовы для следующего шага ?!
rw: Witegure intambwe ikurikira ?!
si: සූදානම්ද පලවෙනි පියවරට?!

source: Great 👌🏽
ar: عظيم 👌🏽
fr: Super 👌🏽
gu: સુંદર 👌🏽
hi: बढ़िया 👌🏽
ru: Отлично 👌🏽
rw: Byiza cyane 👌🏽
si: මරු 👌🏽

source: Right now, you have a fork of the `open-source-edu-bot` repository, but you don't have the files in that repository on your computer.
ar: الآن ، لديك تفرع من مستودع `open-source-edu-bot` ، لكن ليس لديك ملفات هذا المستودع على جهاز الكمبيوتر الخاص بك.
fr: Actuellement, tu as un fork du dépôt `open-source-edu-bot`, mais tu n'as pas les fichiers dans ce dépôt sur ton ordinateur.
gu: હમણાં, તમારી પાસે `ઓપન-સોર્સ-એડુ-બોટ` રીપોઝીટરી ફોર્ક છે, પરંતુ તમારી પાસે તે કોમ્પ્યુટર પરની રીપોઝીટરીમાં ફાઇલો નથી ।
hi: अभी, आपके पास `ओपन-सोर्स-एडू-बॉट` रिपॉजिटरी का प्रतिलिपि है, लेकिन आपके कंप्यूटर पर उस रिपॉजिटरी में फाइलें नहीं हैं।
ru: Прямо сейчас у вас есть ответвление репозитория open-source-edu-bot, но у вас нет файлов в этом репозитории на вашем компьютере.
rw: Kuri ubu, ufite fork ya `open-source-edu-bot`, ariko ntabwo ufite dosiye ziri mur' ubwo bubiko kuri mudasobwa yawe.
si: දැන් ඔයා ගාව `open-source-edu-bot` රිපෝසිටරි එකේ Fork එකක් තියනව, හැබැයි ඔයාගෙ කම්පියුටර් එකේ ඒකෙ ෆයිල් ටික නෑ.
