Repository: fbdevelopercircles/open-source-edu-bot
Catalog: src/locales/sp/LC_MESSAGES/messages.po
Languages: sp

source: Friend
sp: Amigo

source: 🙏🏼 Hi %(first_name)s, so you’ve decided to make your first steps in Open Source. That’s great.
sp: 🙏🏼 Hola %(first_name)s, así que has decidido tomar tus primeros pasos en OpenSource. Genial.

source: ✔️ Yes
sp: ✔️ Sí

source: ❌ Not yet
sp: ❌ Todavía no

source: So, tell me %(first_name)s do you know what Open Source is? 👇🏼
sp: Así que, dime %(first_name)s ¿Sabes qué es Open Source? 👇🏼

source: Make a PR
sp: Hacer un PR

source: Fork me on GitHub
sp: Fork en GitHub

source: Oh you need some help 🆘! This is the main menu, select what you need below 👇🏼
sp: Oh, necesitas algo de ayuda 🆘! Este es el menú principal, selecciona lo que necesitas abajo 👇🏼

source: I didn't get you %(first_name)s! You said : %(msg)s This is the main menu, select what you need below 👇🏼
sp: No te entendí %(first_name)s ! Dijiste : %(msg)s Este es el menú principal, selecciona lo que necesitas abajo 👇🏼

source: %(first_name)s This is the main menu, select what you need below 👇🏼
sp: %(first_name)s Este es el menú principal, selecciona lo que necesitas abajo 👇🏼

source: This is the main menu, select what you need below 👇🏼
sp: Este es el menú principal, selecciona lo que necesitas abajo 👇🏼

source: So, tell me %(first_name)s do you know what Open source is? 👇🏼
sp: Así que, dime %(first_name)s ¿Sabes qué es Open Source? 👇🏼

source: Amazing!
sp: Genial!

source: An important component in Open Source contribution is version control tools. Are you familiar with the concept of version control? 👇🏼
sp: Un componente importante en la contribución Open Source son las herramientas de control de versiones¿Estás familiarizado con el concepto de control de versiones? 👇🏼

source: Open-Source Software, is any Software available for modification ⌨️.This usually includes a license for programmers to change and contribute to the software. 🔧Programmers can fix bugs, improve the software, or adapt it according to their own needs! 🆓
sp: El software Open-Source, es cualquier software disponible para ser modificado ⌨️.Usualmente incluye una iencia para que los programadores cambien y contribuyan al software. 🔧Los programadores pueden arreglar bugs, mejorar el software, o adaptarlo según sus necesidades! 🆓

source: 👉🏽 Next
sp: 👉🏽 Siguiente

source: 👩🏽‍🏫 You know ... ✔️ Wordpress, ✔️ Notepad++, ✔️ Ubuntu and thousands of common software started out as Open-source software? 👇🏼
sp: 👩🏽‍🏫 ¿Sabías que ... ✔️ Wordpress, ✔️Notepad++, ✔️ Ubuntu y miles de los programas más comunes empezaron como software Open-Source? 👇🏼

source: 😎 Worry not! Version control allows you to manage changes to files over time ⏱️ so that you can recall specific versions later.
sp: 😎 No te preoucupes! El control de versiones te permite manejar los cambios a los árchivos en el tiempo ⏱️ así que puedes revisar versiones especificas después.

source: You can use version control to version code, binary files, and digital assets 🗄️.
sp: Puedes usar el control de versiones para crear versiones de código, archivos binarios, y recursos digitales 🗄️.

source: This includes version control software, version control systems, or version control tools 🧰.
sp: Esto incluye el software de control de versiones, sistemas de control de versiones o herramientas de control de versiones 🧰.

source: Version control is a component of software configuration management 🖥️.
sp: El control de versiones es un componente del manejo de la configuración de software 🖥️.

source: 😎 Now that you understand what Version control is, let's explore another important topic.
sp: 😎 Ahora que entiendes lo que el control de versiones es, exploremos otro tema importante.

source: What is Git❔
sp: ¿Qué es Git? ❔

source: What is GitHub? ❔
sp: ¿Qué es GitHub?❔

source: What do you want to start with⁉️ 👇🏼
sp: ¿¡Con qué quieres empezar⁉️ 👇🏼

source: GitHub is a code hosting platform for version control and collaboration. It lets you and others work together on projects from anywhere.
sp: GitHub es una plataforma de alojamiento de código para el control de versiones y la colaboración. Le permite a ti y a otros trabajar juntos en proyectos desde cualquier lugar.

source: Official Website
sp: Sitio oficial

source: GitHub Tutorial
sp: Tutorial de GitHub

source: 👩‍💻 Make a PR
sp: 👩‍💻 Hacer un PR

source: Discover GitHub
sp: Descubre GitHub

source: Discover GitHub official website, or follow a beginner tutorial
sp: Descubre el sitio oficial de GitHub, o sigue el tutorial para principiantes

source: Good question 👌🏽
sp: Buena pregunta 👌🏽

source: Git is a type of version control system (VCS) that makes it easier to track changes to files.
sp: Git es un tipo de sistema de control de versiones (VCS) que facilita el seguimiento de los cambios a los árchivos.

source: For example, when you edit a file, Git can help you determine exactly what changed, who changed it, and why.
sp: Por ejemplo, cuando editas un archivo, Git puede ayudarte a determinar exactamente qué cambió, quién lo cambió, y por qué.

source: 👶🏽 Install Git
sp: 👶🏽 Instalar Git

source: 🤓 I've Git Installed
sp: 🤓 Ya tengo Git instalado

source: Want to learn more about Git?
sp: ¿Quieres aprender más acerca de Git?

source: Good decision 👌🏽
sp: Buena decisión 👌🏽

source: We are going to split the process into 5 steps: 🛵 Fork, Clone, Update, Push and Merge.
sp: Vamos a dividir el proceso en 5 pasos: 🛵 Fork, Clone, Update, Push y Merge.

source: Ready for the first step?!
sp: ¡¿Listo para el primer paso?!

source: Awesome 👌🏽
sp: Genial 👌🏽

source: Open this link in a new window: https://github.com/fbdevelopercircles/open-source-edu-bot
sp: Abre este enlace en una nueva ventana: https://github.com/fbdevelopercircles/open-source-edu-bot

source: Now, click `Fork` on the top right corner of your screen
sp: Ahora, haz click en `Fork` en la esquina suerior derecha de tu pantalla

source: A copy of the original project will be created in your account.
sp: Una copia del proyecto original se creará en tu cuenta.

source: Ready for the next step?!
sp: ¡¿Listo para el siguiente paso?!

source: Great 👌🏽
sp: Super 👌🏽

source: Right now, you have a fork of the `open-source-edu-bot` repository, but you don't have the files in that repository on your computer.
sp: Actuelmente, tienes un fork del repositorio `open-source-edu-bot`, pero no tienes los árchivos de aquel repositorio en tu computadora.

source: Let's create a clone of your fork locally on your computer. On GitHub, in your newly forked project, Click on `Code` above the list of files
sp: Creemos un clon del fork original localemnte en tu computadora. En GitHub, en tu reciente fork del proyecto, clickea en `Code` encima de la lista de árchivos

source: When you feel Ready🔥, hit Next to continue.
sp: Cuando te sientas listo🔥, haz click en Siguiente para continuar.

source: To clone the repository using HTTPS, under "Clone with HTTPS", click copy icon. To clone the repository using an SSH key click "Use SSH", then click on copy icon.
sp: Para clonar el repositorio usando HTTPS, debajo de "Clonar con HTTPS", clickea en el ícono de copiar. Para cloar el repositorio usando una llave SSH, clickea en "Usar SSH", luego haz click en el ícono de copiar.

source: Now open a terminal, change the current working directory to the location where you want the cloned directory.
sp: Ahora abre la terminal, cambia el directorio actual de tranajo a la carpeta en donde quieres el directorio clonado.

source: Type `git clone`, and then paste the URL you copied earlier. Press Enter. Your local clone will be created.
sp: Escribe `git clone`, y luego copia la URL que copiaste anteriormente. Presiona Enter. Tu clón local será creado.

source: Now, you have a local copy of the project, Let's update it!
sp: Ahora, tienes una copia local del proyecto ¡Actualicemosla!

source: Amazing 👌🏽
sp: Genial 👌🏽

source: Open the project using your favorite IDE, and look for `contributors.yaml` file
sp: Abre el proyecto usando tu IDE favorito y busca el árchivo `contributors.yaml`

source: This Yaml file contains list of project contributors, just like you.
sp: Este árchivo Yaml contiene la lista de los cotribuidores del proyecto, cómo tú.

source: Following the same scheme, add your name, country and github username to the list.
sp: Siguiendo el mismo esquema, añade tu nombre, país y nombre de usuario a la lista.

source: Ready to commit & Push your changes?!
sp: ¡¿Listo para hacer un commit y subir tus cambios?!

source: Way to go 👌🏽
sp: Bien hecho 👌🏽

source: Open your Terminal. Change the current working directory to your local repository. Stage the file by commiting it to your local repository using: `git add .`
sp: Abre tu Terminal. Cambia el directorio de trabajo actual a tu repositorio local. Salva el árchivo al hacer commit en tu repositorio local usando: `git add .`

source: Commit the file that you've staged in your local repository: `git commit -m "Add YOUR_NAME to contributors list"` Make sure to add your name :D
sp: Haz un commit del árchivo que salvaste en tu repositorio local: `git commit -m " Add YOUR_NAME to contributors list"` Asegurate de añadir tu nombre :D

source: Finally, Push the changes in your local repository to GitHub: `git push origin master`
sp: Finalmente, haz un Push de los cambios en tu repositorio local a GitHub: `git push origin master`

source: Ready to make your first PR?!
sp: ¡¿Listo para tu primer PR?!

source: Proud of you 👌🏽
sp: Orgulloso de ti 👌🏽

source: Now go back to the original repo: https://github.com/fbdevelopercircles/open-source-edu-bot Above the list of files, click `Pull request`.
sp: Ahora, vuelve al rpositorio original: https://github.com/fbdevelopercircles/open-source-edu-bot Encima de la lista de árchivos, haz click en `Pull request`.

source: Make sure that "base branch" & "head fork" drop-down menus both are pointing to `master`.
sp: Adegurate que los menús de "base branch" y "head fork" estén ambos apuntando a `master`

source: Type a title and description for your pull request. Then click `Create Pull Request`.
sp: Escribe una pequeña descripción para tu PR, luego haz click en `Create Pull Request`

source: ✅ Done
sp: ✅ Hecho

source: Have you created your first PR?
sp: ¿Haz creado tu primer PR?

source: Now the team will review your PR and merge it ASAP :D
sp: Ahora el equipo revisará tu PR y lo aceptará tan pronto como sea posible :D

source: Given below are other interesting stuff that we can explore together:
sp: Abajo ahí otras cosas interesantes que podemos explorar juntos:

source: Time to get Git installed in your machine ⭕!
sp: Hora de instalar GIT en tu máquina ⭕!

source: Download Git
sp: Descarga Git

source: Head over here, and download Git Client based on your OS.
sp: Dirigete aquí, y descarga el cliente de Git basado en tu sistema operativo.

source: Configure Git ⚒️
sp: Configurar Git ⚒️

source: 🧑‍🚀 Once done, let's configure Git
sp: 🧑‍🚀 Una vez hecho esto, configuremos Git

source: Great Progress so far 👨🏽‍🎓!
sp: Gran progreso hasta ahora 👨🏽‍🎓!

source: Now let's configure your Git username and email using the following commands
sp: Ahora configuremos tu usario de Git y correo electrónico usando los siguientes comandos

source: Don't forget to replace Steve's name and email with your own.
sp: No te olvides de reemplazar el nobre de Steve y correo electrónico con el tuyo

source: These details will be associated with any commits that you create
sp: Estos datos serán asocioados con los commits que crees.

source: Now let's check, what is Github?👇🏼
sp: Ahora miremos mirmeos ¿Qué es GitHub?👇🏼

source: Facebook manages many Open Source projects in the following areas: ✔️ Android ✔️ Artificial Intelligence ✔️ Data Infrastructure ✔️ Developer Operations ✔️ Development Tools ✔️ Frontend ✔️ iOS ✔️ Languages ✔️ Linux ✔️ Security ✔️ Virtual Reality ...
sp: Facebook maneja muchos proyectos open source en las siguientes áreas : ✔️ Android ✔️ Intelligencia artifical ✔️ Infrastructura de datos ✔️ Operaciones de desarrolladores ✔️ Herraientas de desarrollo ✔️ Frontend ✔️ iOS ✔️ Lenguajes ✔️ Linux ✔️ Seguridad ✔️ Realidad virtual ...

source: Explore them
sp: Exploremoslos

source: Explore Facebook Open Source projects
sp: Explor los proyectos Open Source de Facebook

source: 🤓 You know what? This chatbot code is Open Source 🔓, it's developed by Facebook Developers Circles members around the world.
sp: 🤓 ¿Sabes? El código de este chatbot es Open Source, está desarrollado por los miembros de los Círculos de Desarrolladores de Facebook al rededor del mundo

source: %(first_name)s we welcome contributors, or simply feel free to fork the code on GitHub, and create your own chatbot.
sp: %(first_name)s demosle la bienvenida a los contribuidores, o simplemente sientete libre de hacer un fork del código en GitHub, y crea tu propio chatbot.

source: The Source Code
sp: El código fuente

source: Join a circle
sp: Unete a un Círculo

source: 🚶🏽‍♀️ Main Menu 🗄️
sp: 🚶🏽‍♀️ Menu principal 🗄️

source: Select an option 👇🏼
sp: Selecciona una opción 👇🏼

source: Coming soon!
sp: Proximamente!
